aa = {
    'id': ['id', '101_1'], 
    'name': ['Назва', 'Башмак НКЗ-10'], 
    'description': ['Опис', ''], 
    'kof_markup': ['Коф націнкки', ''], 
    'purchase_price_₴': ['Ціна закуп ₴', ''], 
    'personal_data': {
        'area':['Площа покриття (м2)' ,'1'], 
        'metal_thickness': ['Товшина металу (мм)' ,'2'],
    },
    'weight': ['Вага', '20'], 
    'dimensions': {
        'height': ['Висота', '1000'],
        'length': ['Довжина, Вильот', '400'],
        'width': ['Ширина, Габарит', '50'],
        'diam': ['Діаметер', '']
        },
    'tags': ['Теги', []],
    'photo': ['Фото', []],
    'logo': ['Лого', []],
    'links_drawing': ['Креслення', []],
    'producer': ['Виробник', ''],
    'shipping_dimensions': [
        'Габарити для відправки', [
            'Висота', '',
            'Ширина', '',
            'Довжина', '',
            'Вага', '',
            'Тип пакування', ''
        ]], 
    'unit': ['Одиниця виміру', ''],
    'location_warehouse': ['Місце знаходження на складі', ''],
    'group_crm': ['Гуппа срм', ''],
    'sten_on': ['Встановлюється на', []],
    'consists_of': ['складається_з', ''],
    'other_data': []
}

puts aa.keys