# aa = {
#     'id': ['id', ''],
#     'name': ['Назва', ''],
#     'description': ['Опис', ''],
#     'kof_markup': ['Коф націнки', ''],
#     'price_$': ['Ціна', ''],
#     'personal_data': {
#         'area': ['Площа покриття', ''],
#         'metal_thickness': ['Товщина металу  (мм)', ''],
#     },
#     'dimensions': {
#         'height': ['Висота', ''],
#         'length': ['Дожина, Вильот', ''],
#         'width': ['Ширина, Габарит', ''],
#         'diam': ['Діаметр', ''],
#         'weight': ['Вага', '']
#     },
#     'tags': ['Теги', []],
#     'photo': ['Фото', []],
#     'logo': ['Лого', []],
#     'links_drawing': ['Креслення', []],
#     'producer': ['Виробник, Постачальник', []],
#     'shipping_dimensions': {
#         'height': ['Висота', ''],
#         'width': ['Ширина', ''],
#         'length': ['Довжина', ''],
#         'packaging_type': ['Тип пакування', ''],
#         'unit': ['Одиниця виміру', '']
#     },
#     'location_warehouse': ['Місце знаходження на складі', ''],
#     'group_crm': ['Группа црм', ''],
#     'sten_on': ['Встановлюється на', ''],
#     'consists_of': ['складається з', ''],
#     'other_data': {

#     }
# }
aa = {
  'id': ['id', ''],
  'name': ['Назва', ''],
  'description': ['Опис', ''],
  'kof_markup': ['Коф націнки', ''],
  'price_$': ['Ціна', ''],
  'personal_data': {
    'area': ['Площа покриття', ''],
    'metal_thickness': ['Товщина металу  (мм)', ''],
  },
  'dimensions': {
    'height': ['Висота', ''],
    'length': ['Дожина, Вильот', ''],
    'width': ['Ширина, Габарит', ''],
    'diam': ['Діаметр', ''],
    'weight': ['Вага', '']
  },
  'tags': ['Теги', []],
  'photo': ['Фото', []],
  'logo': ['Лого', []],
  'links_drawing': ['Креслення', []],
  'producer': ['Виробник, Постачальник', []],
  'shipping_dimensions': {
    'height': ['Висота', ''],
    'width': ['Ширина', ''],
    'length': ['Довжина', ''],
    'packaging_type': ['Тип пакування', '']
  },
  'unit': ['Одиниця виміру', ''],
  'location_warehouse': ['Місце знаходження на складі', ''],
  'group_crm': ['Группа црм', ''],
  'sten_on': ['Встановлюється на', ''],
  'consists_of': ['складається з', ''],
  'other_data': {}
}
puts aa.keys